src/Reports/ИменнойСписокПринятыхУволенныхВоеннообязанных.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Report>
		<Properties>
			<Name>ИменнойСписокПринятыхУволенныхВоеннообязанных</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачПериод</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонПериод</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Военкомат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Военкоматы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВоенноОбязПодписиСотр</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВоенноОбязПодписиДолж</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДолжностиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВклКадрПеремещения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВклИзмРегСвСемПолож</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчитыватьИзмененияПоОбразованию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

src/InformationRegisters/КонтактнаяИнформация.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>КонтактнаяИнформация</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Представление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле1</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле2</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле3</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле4</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле5</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле6</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле7</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле8</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле9</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле10</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеПоУмолчанию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле11</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле12</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле13</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Тип</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Вид</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/РаботникиОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>РаботникиОрганизаций</Name>
			<Comment>(Регл)</Comment>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЗанимаемыхСтавок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОбособленноеПодразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПодразделениеОрганизации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДолжностиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГрафикРаботы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГрафикиРаботы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПериодЗавершения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗанимаемыхСтавокЗавершения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОбособленноеПодразделениеЗавершения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПодразделениеОрганизацииЗавершения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДолжностьЗавершения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДолжностиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГрафикРаботыЗавершения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГрафикиРаботы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПричинаИзмененияСостояния</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПричиныИзмененияСостояния</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПричинаИзмененияСостоянияЗавершения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПричиныИзмененияСостояния</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РазрядЕТС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>4</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоэффициентЕТС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПовышенныйКоэффициентЕТС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Категория</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КатегорииРаботников</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИтоговоеПовышениеПоИнструкции</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Временно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТарифнаяСтавкаПервогоРазряда</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТарифныеСтавкиПервогоРазряда</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УсловияТрудаИзмерение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УсловияТруда</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидДеятельностиИзмерение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОсобыеУсловияТруда</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипРаботника</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыРаботников</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СотрудникЗаменяемый</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>БезЕТС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОкладВВалюте</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДляПечати</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИсключитьИзПУ2</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ауМестоРаботы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СЭ_МестаРаботы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВременныйПереводКлимовичи</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ОбособленноеПодразделениеРБ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбособленноеПодразделениеРБ1</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипРаботникаУдалить</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыРаботников</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьСотрудникЗаменяемый</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Enums/ОтношениеКВоинскомуУчету.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ОтношениеКВоинскомуУчету</Name>
			<Comment>(Регл)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Состоит</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Встает</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеСостоит</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СнятПоВозрасту</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СнятПоСостояниюЗдоровья</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Reports/ИменнойСписокПринятыхУволенныхВоеннообязанных/Ext/ObjectModule.bsl
Перем мМакет, мНомер;

#Если Клиент Тогда
Функция СформироватьЗапросПоСемье(ФизЛицо)	
	Запрос = Новый Запрос;
	ТекстЗапроса = "ВЫБРАТЬ
	|	НДФЛСтандартныеВычетыФизлицСоставСемьи.СтепеньРодства КАК СтепеньРодства,
	|	НДФЛСтандартныеВычетыФизлицСоставСемьи.Имя,
	|	НДФЛСтандартныеВычетыФизлицСоставСемьи.ДатаРождения
	|ИЗ
	|	Документ.НДФЛСтандартныеВычетыФизлиц.СоставСемьи КАК НДФЛСтандартныеВычетыФизлицСоставСемьи
	|ГДЕ
	|	НДФЛСтандартныеВычетыФизлицСоставСемьи.Ссылка.Физлицо = &Физлицо
	|	И НДФЛСтандартныеВычетыФизлицСоставСемьи.СтепеньРодства <> &СтепеньРодства
	
	//Аверсон 25.03.2020 КВВ СВФР-005728 (
	|		СГРУППИРОВАТЬ ПО
	|		НДФЛСтандартныеВычетыФизлицСоставСемьи.СтепеньРодства,
	|		НДФЛСтандартныеВычетыФизлицСоставСемьи.Имя,
	|		НДФЛСтандартныеВычетыФизлицСоставСемьи.ДатаРождения
	//Аверсон 25.03.2020 КВВ СВФР-005728 )
	
	|УПОРЯДОЧИТЬ ПО
	|	СтепеньРодства";

	Запрос.УстановитьПараметр("Физлицо", ФизЛицо);
	Запрос.УстановитьПараметр("СтепеньРодства", Справочники.СтепениРодстваФизЛиц.ПустаяСсылка());

	Запрос.Текст = ТекстЗапроса;
	
	Возврат Запрос.Выполнить();
КонецФункции

Функция СформироватьЗапросПоКонтактнойИнформации(ФизЛицо)	
	Запрос = Новый Запрос;
	ТекстЗапроса = "ВЫБРАТЬ
	|	КонтактнаяИнформация.Объект,
	|	ВЫБОР
	|		КОГДА КонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ЮрАдресФизЛица)
	|			ТОГДА КонтактнаяИнформация.Представление
	|		ИНАЧЕ NULL
	|	КОНЕЦ КАК Адрес,
	|	ВЫБОР
	|		КОГДА КонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ТелефонФизЛица)
	|			ТОГДА КонтактнаяИнформация.Представление
	|		ИНАЧЕ NULL
	|	КОНЕЦ КАК Телефон,
	|	КонтактнаяИнформация.Тип КАК Тип,
	|	КонтактнаяИнформация.Вид,
	|	КонтактнаяИнформация.Представление
	|ИЗ
	|	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	|ГДЕ
	|	КонтактнаяИнформация.Объект = &Объект
	|	И (КонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ЮрАдресФизЛица)
	//|			ИЛИ КонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ТелефонФизЛица))
	|	ИЛИ КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон))  //Аверсон 25.03.2020 КВВ СВФР-005728
	|УПОРЯДОЧИТЬ ПО
	|	Тип УБЫВ";

	Запрос.УстановитьПараметр("Объект", ФизЛицо);
	Запрос.Текст = ТекстЗапроса;
	
	Возврат Запрос.Выполнить();
КонецФункции

Процедура ВывестиСтрокиПодразделения(ВыборкаСписка, ДокументРезультат)
	
	Пока ВыборкаСписка.Следующий() Цикл 
		
		//Аверсон 25.03.2020 КВВ СВФР-005728 (
		Подр = ""; Долж = "";
		Если ТипЗнч(ВыборкаСписка.Ссылка) = Тип("ДокументСсылка.ИзменениеПериодическихРеквизитов") Тогда
			З = Новый Запрос;
			З.Текст = "ВЫБРАТЬ 
			|СотрСП.ПодразделениеОрганизации,
			|СотрСП.Должность
			|ИЗ РегистрСведений.РаботникиОрганизаций.СрезПоследних(&П) КАК СотрСП
			|ГДЕ СотрСП.Сотрудник.ФизЛицо = &ФЛ";
			З.УстановитьПараметр("ФЛ", ВыборкаСписка.ФизЛицо);
			З.УстановитьПараметр("П", ВыборкаСписка.Дата);
			Рез = З.Выполнить().Выбрать();
			Пока Рез.Следующий() Цикл
				Подр = Рез.ПодразделениеОрганизации; 
				Долж = Рез.Должность;
			КонецЦикла;
			Если НЕ ЗначениеЗаполнено(Подр) И НЕ ЗначениеЗаполнено(Долж) Тогда
				Продолжить;
			КонецЕсли;
			
			Подр2 = ""; Долж2 = "";
			З2 = Новый Запрос;
			З2.Текст = "ВЫБРАТЬ 
			|СотрСП.ПодразделениеОрганизации,
			|СотрСП.Должность
			|ИЗ РегистрСведений.РаботникиОрганизаций.СрезПоследних(&П) КАК СотрСП
			|ГДЕ СотрСП.Сотрудник.ФизЛицо = &ФЛ";
			З2.УстановитьПараметр("ФЛ", ВыборкаСписка.ФизЛицо);
			З2.УстановитьПараметр("П", НачалоДня(ВыборкаСписка.Дата)-1);
			Рез2 = З2.Выполнить().Выбрать();
			Пока Рез2.Следующий() Цикл
				Подр2 = Рез2.ПодразделениеОрганизации; 
				Долж2 = Рез2.Должность;
			КонецЦикла;
			Если НЕ ЗначениеЗаполнено(Подр2) И НЕ ЗначениеЗаполнено(Долж2) Тогда
				Продолжить;
			КонецЕсли;

		КонецЕсли;
		//Аверсон 25.03.2020 КВВ СВФР-005728 )
		
		мНомер = мНомер + 1;
		ОбластьДетальныхЗаписей = мМакет.ПолучитьОбласть("Строка");
		ОбластьДетальныхЗаписей.Параметры.Ном = мНомер;
		ОбластьДетальныхЗаписей.Параметры.ВоинскоеЗвание = ВыборкаСписка.Звание;	
		ОбластьДетальныхЗаписей.Параметры.Работник = ВРег(ВыборкаСписка.Фамилия) + Символы.ПС + ВыборкаСписка.Имя + Символы.ПС + ВыборкаСписка.Отчество + Символы.ПС;
		Если ТипЗнч(ВыборкаСписка.Ссылка) = Тип("ДокументСсылка.ПриемНаРаботуВОрганизацию") Тогда
			ОбластьДетальныхЗаписей.Параметры.ПринятУволен = Строка("(ПРИНЯТ)");
		ИначеЕсли ТипЗнч(ВыборкаСписка.Ссылка) = Тип("ДокументСсылка.УвольнениеИзОрганизаций") Тогда
			ОбластьДетальныхЗаписей.Параметры.ПринятУволен = Строка("(УВОЛЕН)");
			//Аверсон 25.03.2020 КВВ СВФР-005728 (
		ИначеЕсли ТипЗнч(ВыборкаСписка.Ссылка) = Тип("ДокументСсылка.КадровоеПеремещениеОрганизаций") Тогда
			ОбластьДетальныхЗаписей.Параметры.ПринятУволен = Строка("(ПЕРЕВЕДЕН)");
		Иначе
			ОбластьДетальныхЗаписей.Параметры.ПринятУволен = Строка("(ИЗМЕНЕН)");
			//Аверсон 25.03.2020 КВВ СВФР-005728  )
		КонецЕсли;
	//	ОбластьДетальныхЗаписей.Параметры.ГодРождения = Формат(Год(ВыборкаСписка.ФизЛицо.ДатаРождения), "ЧГ=0");
		ОбластьДетальныхЗаписей.Параметры.ГодРождения = Формат(ВыборкаСписка.ФизЛицо.ДатаРождения,"ДФ=dd.MM.yyyy");  //Аверсон 25.03.2020 КВВ СВФР-005728
		ОбластьДетальныхЗаписей.Параметры.ВУС = ВыборкаСписка.ВУС1;
		//Если ЗначениеЗаполнено(ВыборкаСписка.НомерВоенногоБилета) Тогда
		//	ОбластьДетальныхЗаписей.Параметры.ВоенБилет = ?(ЗначениеЗаполнено(ВыборкаСписка.ВУС), " , № в/б ", "№ в/б ") + ВыборкаСписка.НомерВоенногоБилета;
		//КонецЕсли;
		ТаблОбразование = ВыборкаСписка.ФизЛицо.Образование;
		Образование = "";
		Для Каждого ТекСтрока Из ТаблОбразование Цикл
			//СВЭЙ 12.11.2023 КВВ СВФР-011792 (пункт 1) (
			//Образование = СокрЛП(ТекСтрока.УчебноеЗаведение.Наименование) + " в " + Формат(ТекСтрока.ГодОкончания, "ЧГ=0") + " г.";
			Если ТекСтрока.ОсновноеОбразование Тогда
				Образование = ?(ЗначениеЗаполнено(Образование),", ","") + СокрЛП(ТекСтрока.УчебноеЗаведение.Наименование) + " в " + Формат(ТекСтрока.ГодОкончания, "ЧГ=0") + " г.";
			КонецЕсли;
			//СВЭЙ 12.11.2023 КВВ СВФР-011792 (пункт 1) )
		КонецЦикла;
		ОбластьДетальныхЗаписей.Параметры.Образование = Образование;		
		//ОбластьДетальныхЗаписей.Параметры.ДатаПриемУвольн = Формат(ВыборкаСписка.Дата, "ДФ=dd.MM.yy") + " г.";
		ОбластьДетальныхЗаписей.Параметры.ДатаПриемУвольн = Формат(ВыборкаСписка.Дата, "ДФ=dd.MM.yyyy");  //Аверсон 25.03.2020 КВВ СВФР-005728

		//ОбластьДетальныхЗаписей.Параметры.Приказ = " пр." + СокрЛП(ВыборкаСписка.Ссылка.Номер) + " от " + Формат(ВыборкаСписка.Ссылка.Дата, "ДФ=dd.MM.yyyy") + ", ";
		ОбластьДетальныхЗаписей.Параметры.Должность = НРег(СокрЛП(?(ЗначениеЗаполнено(ВыборкаСписка.Должность.Наименование),ВыборкаСписка.Должность.Наименование,Долж.Наименование))); //Аверсон 25.03.2020 КВВ СВФР-005728

		КакоеПодрБрать = ?(ЗначениеЗаполнено(ВыборкаСписка.ПодразделениеОрганизации),ВыборкаСписка.ПодразделениеОрганизации,Подр); //Аверсон 25.03.2020 КВВ СВФР-005728
		НаименованиеПодразделения = ПроцедурыУправленияПерсоналом.ПросклонятьСтрРезультат(глЗначениеПеременной("глКомпонентаСклоненияФИО"),КакоеПодрБрать.Наименование, 2, , КакоеПодрБрать, 1); //Аверсон 25.03.2020 КВВ СВФР-005728
		НаименованиеПодразделения = НРег(Лев(НаименованиеПодразделения,1)) + Прав(НаименованиеПодразделения,СтрДлина(НаименованиеПодразделения) - 1);
		ОбластьДетальныхЗаписей.Параметры.Подр = НаименованиеПодразделения;
		
		ВыборкаКонтИнф = СформироватьЗапросПоКонтактнойИнформации(ВыборкаСписка.ФизЛицо).Выбрать();
		Строка = "";
		Пока ВыборкаКонтИнф.Следующий() Цикл
			Если ЗначениеЗаполнено(ВыборкаКонтИнф.Адрес) Тогда
				Строка = Строка + СокрЛП(ВыборкаКонтИнф.Адрес);
			КонецЕсли;
			//Если ЗначениеЗаполнено(ВыборкаКонтИнф.Телефон) Тогда  
			//Строка = Строка + ?(ЗначениеЗаполнено(Строка), "," + Символы.ПС, "")+ "тел.: " + СокрЛП(ВыборкаКонтИнф.Телефон);
			//Аверсон 25.03.2020 КВВ СВФР-005728 (
			Если СокрЛП(ВыборкаКонтИнф.Вид) = "Телефон мобильный" И ЗначениеЗаполнено(ВыборкаКонтИнф.Представление) Тогда
				Строка = Строка + ?(ЗначениеЗаполнено(Строка), "," + Символы.ПС, "")+ "тел.: " + СокрЛП(ВыборкаКонтИнф.Представление);
				//Аверсон 25.03.2020 КВВ СВФР-005728 )
			КонецЕсли;
		КонецЦикла;
		ОбластьДетальныхЗаписей.Параметры.Строка = Строка;
		
		ВыборкаСемья = СформироватьЗапросПоСемье(ВыборкаСписка.ФизЛицо).Выбрать();
		Строка = ""; ЕстьДети = Ложь;
		Пока ВыборкаСемья.Следующий() Цикл
			Строка = Строка + ?(ЗначениеЗаполнено(Строка),", ", "") + СокрЛП(ВыборкаСемья.СтепеньРодства.Наименование) + " - " + СокрЛП(ВыборкаСемья.Имя) + ?(ЗначениеЗаполнено(ВыборкаСемья.ДатаРождения),", " + Формат(ВыборкаСемья.ДатаРождения,"ДФ=dd.MM.yyyy") + " г.р.","");
			//Аверсон 25.03.2020 КВВ СВФР-005728 (
			Если Нрег(СокрЛП(ВыборкаСемья.СтепеньРодства.Наименование)) = "сын" ИЛИ Нрег(СокрЛП(ВыборкаСемья.СтепеньРодства.Наименование)) = "дочь" Тогда
				ЕстьДети = Истина;
			КонецЕсли;
			//Аверсон 25.03.2020 КВВ СВФР-005728 )
		КонецЦикла;
		ОбластьДетальныхЗаписей.Параметры.СемПоложение = СокрЛП(СокрЛП(ВыборкаСписка.СемейноеПоложение) + Символы.ПС + " " + Строка) + ?(ЕстьДети = Ложь,Символы.ПС+ "детей нет",""); //Аверсон 25.03.2020 КВВ СВФР-005728

		ДокументРезультат.Вывести(ОбластьДетальныхЗаписей);
		
		ВывестиСтрокиПодразделения(ВыборкаСписка, ДокументРезультат)
		
	КонецЦикла;//цикл по подразделениям текущего уровня 	
КонецПроцедуры

//Аверсон 27.11.2020 ПСА СВФР-006882 +++
Процедура ВывестиСтрокиПодразделенияПриложение5(ВыборкаСписка, ДокументРезультат)
	
	Пока ВыборкаСписка.Следующий() Цикл 
		
		//Аверсон 25.03.2020 КВВ СВФР-005728 (
		Подр = ""; Долж = "";
		Если ТипЗнч(ВыборкаСписка.Ссылка) = Тип("ДокументСсылка.ИзменениеПериодическихРеквизитов") Тогда
			З = Новый Запрос;
			З.Текст = "ВЫБРАТЬ 
			|СотрСП.ПодразделениеОрганизации,
			|СотрСП.Должность
			|ИЗ РегистрСведений.РаботникиОрганизаций.СрезПоследних(&П) КАК СотрСП
			|ГДЕ СотрСП.Сотрудник.ФизЛицо = &ФЛ";
			З.УстановитьПараметр("ФЛ", ВыборкаСписка.ФизЛицо);
			З.УстановитьПараметр("П", ВыборкаСписка.Дата);
			Рез = З.Выполнить().Выбрать();
			Пока Рез.Следующий() Цикл
				Подр = Рез.ПодразделениеОрганизации; 
				Долж = Рез.Должность;
			КонецЦикла;
			Если НЕ ЗначениеЗаполнено(Подр) И НЕ ЗначениеЗаполнено(Долж) Тогда
				Продолжить;
			КонецЕсли;
			
			Подр2 = ""; Долж2 = "";
			З2 = Новый Запрос;
			З2.Текст = "ВЫБРАТЬ 
			|СотрСП.ПодразделениеОрганизации,
			|СотрСП.Должность
			|ИЗ РегистрСведений.РаботникиОрганизаций.СрезПоследних(&П) КАК СотрСП
			|ГДЕ СотрСП.Сотрудник.ФизЛицо = &ФЛ";
			З2.УстановитьПараметр("ФЛ", ВыборкаСписка.ФизЛицо);
			З2.УстановитьПараметр("П", НачалоДня(ВыборкаСписка.Дата)-1);
			Рез2 = З2.Выполнить().Выбрать();
			Пока Рез2.Следующий() Цикл
				Подр2 = Рез2.ПодразделениеОрганизации; 
				Долж2 = Рез2.Должность;
			КонецЦикла;
			Если НЕ ЗначениеЗаполнено(Подр2) И НЕ ЗначениеЗаполнено(Долж2) Тогда
				Продолжить;
			КонецЕсли;

		КонецЕсли;
		//Аверсон 25.03.2020 КВВ СВФР-005728 )
		
		мНомер = мНомер + 1;
		ОбластьДетальныхЗаписей = мМакет.ПолучитьОбласть("Строка");
		ОбластьДетальныхЗаписей.Параметры.Ном = мНомер;
		ОбластьДетальныхЗаписей.Параметры.ВоинскоеЗвание = ВыборкаСписка.Звание;	
		ОбластьДетальныхЗаписей.Параметры.Работник = ВРег(ВыборкаСписка.Фамилия) + Символы.ПС + ВыборкаСписка.Имя + Символы.ПС + ВыборкаСписка.Отчество + Символы.ПС
		
		//Аверсон ЕАЕ 04.02.2022 СВФР-008704
		+ ВыборкаСписка.ИдентификационныйНомер + Символы.ПС;
		//Аверсон СВФР-008704
		
		Если ТипЗнч(ВыборкаСписка.Ссылка) = Тип("ДокументСсылка.ПриемНаРаботуВОрганизацию") Тогда
			ОбластьДетальныхЗаписей.Параметры.Основание = Строка("Принят(а) на учет ") + Формат(ВыборкаСписка.Дата,"ДФ=dd.MM.yyyy");
		ИначеЕсли ТипЗнч(ВыборкаСписка.Ссылка) = Тип("ДокументСсылка.УвольнениеИзОрганизаций") ИЛИ 
					ВыборкаСписка.ОтношениеКВоинскомуУчету = Перечисления.ОтношениеКВоинскомуУчету.СнятПоВозрасту Тогда //Аверсон ЕАЕ 16.09.2025 СВФР-016658
			ОбластьДетальныхЗаписей.Параметры.Основание = Строка("Снят(а) с учета ") + Формат(ВыборкаСписка.Дата,"ДФ=dd.MM.yyyy");;
		//	//Аверсон 25.03.2020 КВВ СВФР-005728 (
		//ИначеЕсли ТипЗнч(ВыборкаСписка.Ссылка) = Тип("ДокументСсылка.КадровоеПеремещениеОрганизаций") Тогда
		//	ОбластьДетальныхЗаписей.Параметры.ПринятУволен = Строка("(ПЕРЕВЕДЕН)");
		Иначе
			ОбластьДетальныхЗаписей.Параметры.Основание = Строка("Изменение данных");
		//	//Аверсон 25.03.2020 КВВ СВФР-005728  )
		КонецЕсли;
	//	ОбластьДетальныхЗаписей.Параметры.ГодРождения = Формат(Год(ВыборкаСписка.ФизЛицо.ДатаРождения), "ЧГ=0");
		ОбластьДетальныхЗаписей.Параметры.ГодРождения = Формат(ВыборкаСписка.ФизЛицо.ДатаРождения,"ДФ=dd.MM.yyyy");  //Аверсон 25.03.2020 КВВ СВФР-005728
		ОбластьДетальныхЗаписей.Параметры.ВУС = ВыборкаСписка.ВУС1;
		//Если ЗначениеЗаполнено(ВыборкаСписка.НомерВоенногоБилета) Тогда
		//	ОбластьДетальныхЗаписей.Параметры.ВоенБилет = ?(ЗначениеЗаполнено(ВыборкаСписка.ВУС), " , № в/б ", "№ в/б ") + ВыборкаСписка.НомерВоенногоБилета;
		//КонецЕсли;
		ТаблОбразование = ВыборкаСписка.ФизЛицо.Образование;
		Образование = "";
		Для Каждого ТекСтрока Из ТаблОбразование Цикл
			//СВЭЙ 12.11.2023 КВВ СВФР-011792 (пункт 1) (
			//Образование = СокрЛП(ТекСтрока.УчебноеЗаведение.Наименование) + " в " + Формат(ТекСтрока.ГодОкончания, "ЧГ=0") + " г.";
			Если ТекСтрока.ОсновноеОбразование Тогда
				
				//Аверсон ЕАЕ 12.09.2025 СВФР-016658
				//Образование = ?(ЗначениеЗаполнено(Образование),", ","") + СокрЛП(ТекСтрока.УчебноеЗаведение.Наименование) + " в " + Формат(ТекСтрока.ГодОкончания, "ЧГ=0") + " г.";
				Образование = Образование + ?(ЗначениеЗаполнено(Образование),", ","") + СокрЛП(ТекСтрока.УчебноеЗаведение.Наименование) + " в " + Формат(ТекСтрока.ГодОкончания, "ЧГ=0") + " г.";
				//Аверсон СВФР-016658
					
				КонецЕсли;
			//СВЭЙ 12.11.2023 КВВ СВФР-011792 (пункт 1) )
		КонецЦикла;
		
		Если ВыборкаСписка.ОтношениеКВоинскомуУчету = Перечисления.ОтношениеКВоинскомуУчету.СнятПоВозрасту Тогда //Аверсон ЕАЕ 16.09.2025 СВФР-016658
			ОбластьДетальныхЗаписей.Параметры.Образование = "";
		Иначе
			ОбластьДетальныхЗаписей.Параметры.Образование = Образование;
		КонецЕсли;
		
		//ОбластьДетальныхЗаписей.Параметры.ДатаПриемУвольн = Формат(ВыборкаСписка.Дата, "ДФ=dd.MM.yy") + " г.";
		//ОбластьДетальныхЗаписей.Параметры.ДатаПриемУвольн = Формат(ВыборкаСписка.Дата, "ДФ=dd.MM.yyyy");  //Аверсон 25.03.2020 КВВ СВФР-005728

		//ОбластьДетальныхЗаписей.Параметры.Приказ = " пр." + СокрЛП(ВыборкаСписка.Ссылка.Номер) + " от " + Формат(ВыборкаСписка.Ссылка.Дата, "ДФ=dd.MM.yyyy") + ", ";
		
		Если ВыборкаСписка.ОтношениеКВоинскомуУчету = Перечисления.ОтношениеКВоинскомуУчету.СнятПоВозрасту Тогда //Аверсон ЕАЕ 16.09.2025 СВФР-016658
			ОбластьДетальныхЗаписей.Параметры.Должность = "";
		Иначе
			ОбластьДетальныхЗаписей.Параметры.Должность = НРег(СокрЛП(?(ЗначениеЗаполнено(ВыборкаСписка.Должность.Наименование),ВыборкаСписка.Должность.Наименование,Долж.Наименование))); //Аверсон 25.03.2020 КВВ СВФР-005728
		КонецЕсли;

		КакоеПодрБрать = ?(ЗначениеЗаполнено(ВыборкаСписка.ПодразделениеОрганизации),ВыборкаСписка.ПодразделениеОрганизации,Подр); //Аверсон 25.03.2020 КВВ СВФР-005728
		НаименованиеПодразделения = ПроцедурыУправленияПерсоналом.ПросклонятьСтрРезультат(глЗначениеПеременной("глКомпонентаСклоненияФИО"),КакоеПодрБрать.Наименование, 2, , КакоеПодрБрать, 1); //Аверсон 25.03.2020 КВВ СВФР-005728
		НаименованиеПодразделения = НРег(Лев(НаименованиеПодразделения,1)) + Прав(НаименованиеПодразделения,СтрДлина(НаименованиеПодразделения) - 1);
		
		Если ВыборкаСписка.ОтношениеКВоинскомуУчету = Перечисления.ОтношениеКВоинскомуУчету.СнятПоВозрасту Тогда //Аверсон ЕАЕ 16.09.2025 СВФР-016658
			ОбластьДетальныхЗаписей.Параметры.Подр = "";
		Иначе
			ОбластьДетальныхЗаписей.Параметры.Подр = НаименованиеПодразделения;
		КонецЕсли;
		
		ВыборкаКонтИнф = СформироватьЗапросПоКонтактнойИнформации(ВыборкаСписка.ФизЛицо).Выбрать();
		Строка = "";
		Телефон = "";
		Пока ВыборкаКонтИнф.Следующий() Цикл
			Если ЗначениеЗаполнено(ВыборкаКонтИнф.Адрес) Тогда
				Строка = Строка + СокрЛП(ВыборкаКонтИнф.Адрес);
			КонецЕсли;
			//Если ЗначениеЗаполнено(ВыборкаКонтИнф.Телефон) Тогда  
			//Строка = Строка + ?(ЗначениеЗаполнено(Строка), "," + Символы.ПС, "")+ "тел.: " + СокрЛП(ВыборкаКонтИнф.Телефон);
			//Аверсон 25.03.2020 КВВ СВФР-005728 (
			Если СокрЛП(ВыборкаКонтИнф.Вид) = "Телефон мобильный" И ЗначениеЗаполнено(ВыборкаКонтИнф.Представление) Тогда
				Телефон = СокрЛП(ВыборкаКонтИнф.Представление);
				//Аверсон 25.03.2020 КВВ СВФР-005728 )
			КонецЕсли;
		КонецЦикла;
		
		Если ВыборкаСписка.ОтношениеКВоинскомуУчету = Перечисления.ОтношениеКВоинскомуУчету.СнятПоВозрасту Тогда //Аверсон ЕАЕ 16.09.2025 СВФР-016658
			ОбластьДетальныхЗаписей.Параметры.Строка = "";
			ОбластьДетальныхЗаписей.Параметры.Телефон = "";
		Иначе
			ОбластьДетальныхЗаписей.Параметры.Строка = Строка;
			ОбластьДетальныхЗаписей.Параметры.Телефон = Телефон;
		КонецЕсли;

		ВыборкаСемья = СформироватьЗапросПоСемье(ВыборкаСписка.ФизЛицо).Выбрать();
		Строка = ""; ЕстьДети = Ложь;
		Пока ВыборкаСемья.Следующий() Цикл
			Строка = Строка + ?(ЗначениеЗаполнено(Строка),", ", "") + СокрЛП(ВыборкаСемья.СтепеньРодства.Наименование) + " - " + СокрЛП(ВыборкаСемья.Имя) + ?(ЗначениеЗаполнено(ВыборкаСемья.ДатаРождения),", " + Формат(ВыборкаСемья.ДатаРождения,"ДФ=dd.MM.yyyy") + " г.р.","");
			//Аверсон 25.03.2020 КВВ СВФР-005728 (
			Если Нрег(СокрЛП(ВыборкаСемья.СтепеньРодства.Наименование)) = "сын" ИЛИ Нрег(СокрЛП(ВыборкаСемья.СтепеньРодства.Наименование)) = "дочь" Тогда
				ЕстьДети = Истина;
			КонецЕсли;
			//Аверсон 25.03.2020 КВВ СВФР-005728 )
		КонецЦикла;
		
		Если ВыборкаСписка.ОтношениеКВоинскомуУчету = Перечисления.ОтношениеКВоинскомуУчету.СнятПоВозрасту Тогда //Аверсон ЕАЕ 16.09.2025 СВФР-016658
			ОбластьДетальныхЗаписей.Параметры.СемПоложение = "";
		Иначе
			ОбластьДетальныхЗаписей.Параметры.СемПоложение = СокрЛП(СокрЛП(ВыборкаСписка.СемейноеПоложение) + Символы.ПС + " " + Строка) + ?(ЕстьДети = Ложь,Символы.ПС+ "детей нет",""); //Аверсон 25.03.2020 КВВ СВФР-005728
		КонецЕсли;

		//Аверсон ЕАЕ 16.09.2025 СВФР-016658
		Если ВыборкаСписка.ОтношениеКВоинскомуУчету = Перечисления.ОтношениеКВоинскомуУчету.СнятПоВозрасту Тогда
			ОбластьДетальныхЗаписей.Параметры.ОсобыеОтметки = "достиг предельного возраста состояния в запасе";
		КонецЕсли;
		//Аверсон СВФР-016658
		
		ДокументРезультат.Вывести(ОбластьДетальныхЗаписей);
		
		ВывестиСтрокиПодразделенияПриложение5(ВыборкаСписка, ДокументРезультат)
		
	КонецЦикла;//цикл по подразделениям текущего уровня 	
КонецПроцедуры
//+++Аверсон 27.11.2020 ПСА СВФР-006882


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ
// Выполняет запрос и формирует табличный документ-результат отчета
// в соответствии с настройками, заданными значениями реквизитов отчета.
//
// Параметры:
//	ДокументРезультат - табличный документ, формируемый отчетом
//  Дописать - булево.  Истина - табличный документ дописывается формируемым отчетом, 
//                      Ложь - заполняется формируемым отчетом (с предварительной очистой 
//                      табличного документа)
//
Процедура СформироватьОтчет(ДокументРезультат, Дописать = Ложь, мВоенноОбязПодписиДолж,мВоенноОбязПодписиСотр) Экспорт
	//Аверсон 27.11.2020 ПСА СВФР-006882 +++
	Если Истина Тогда
		СформироватьОтчетПриложение5(ДокументРезультат, Дописать, мВоенноОбязПодписиДолж,мВоенноОбязПодписиСотр)
	Иначе	
	мМакет = ПолучитьМакет("Макет");
	
	Запрос = Новый Запрос;
	ТекстЗапроса = "";
	//Аверсон 25.03.2020 КВВ СВФР-005728 (
	Если ВклИзмРегСвСемПолож Тогда
		ТекстЗапроса = 	"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ЗНАЧЕНИЕ(Документ.ИзменениеПериодическихРеквизитов.ПустаяСсылка) КАК Ссылка,
		|	СПФЛ.ФизЛицо КАК ФизЛицо,
		|	СПФЛ.Период КАК Дата,
		|	ВоинскийУчетСрезПоследних.ОтношениеКВоинскойОбязанности,
		|	ЗНАЧЕНИЕ(Справочник.ДолжностиОрганизаций.ПустаяСсылка) КАК Должность,
		|	ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка) КАК ПодразделениеОрганизации,
		|	ВоинскийУчетСрезПоследних.ВУС1,
		|	ВоинскийУчетСрезПоследних.Звание,
		|	ВоинскийУчетСрезПоследних.Военкомат,
		|	ВоинскийУчетСрезПоследних.НомерВоенногоБилета,	
		|	ФИОФизЛицСрезПоследних.Фамилия,
		|	ФИОФизЛицСрезПоследних.Имя,
		|	ФИОФизЛицСрезПоследних.Отчество,
		|	СПФЛ.ФизЛицо.Наименование КАК ФизЛицоНаименование,
		|	СемейноеПоложениеФизЛицСрезПоследних.СемейноеПоложение
		|ИЗ
		|	РегистрСведений.СемейноеПоложениеФизЛиц КАК СПФЛ
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВоинскийУчет.СрезПоследних(&КонПериода, ) КАК ВоинскийУчетСрезПоследних
		|		ПО СПФЛ.ФизЛицо = ВоинскийУчетСрезПоследних.Физлицо
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
		|		ПО СПФЛ.ФизЛицо = КонтактнаяИнформация.Объект
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизЛиц.СрезПоследних(&КонПериода, ) КАК ФИОФизЛицСрезПоследних
		|		ПО СПФЛ.ФизЛицо = ФИОФизЛицСрезПоследних.ФизЛицо
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СемейноеПоложениеФизЛиц.СрезПоследних КАК СемейноеПоложениеФизЛицСрезПоследних
		|   	ПО СПФЛ.ФизЛицо = СемейноеПоложениеФизЛицСрезПоследних.ФизЛицо
		|ГДЕ
		|	(ВоинскийУчетСрезПоследних.ОтношениеКВоинскойОбязанности = ЗНАЧЕНИЕ(Перечисление.ОтношениеКВоинскойОбязанности.Военнообязанный)
		|    ИЛИ ВоинскийУчетСрезПоследних.ОтношениеКВоинскойОбязанности = ЗНАЧЕНИЕ(Перечисление.ОтношениеКВоинскойОбязанности.Призывник))
		|	И СПФЛ.Период МЕЖДУ &НачПериода И &КонПериода
		|	//И ВоинскийУчетСрезПоследних.Военкомат = &Военкомат
		|ОБЪЕДИНИТЬ ВСЕ
		|";
	КонецЕсли;
	
	Если ВклКадрПеремещения Тогда 
		ТекстЗапроса = ТекстЗапроса + "
		|	ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	КадровоеПеремещениеОрганизаций.Ссылка,
		|	КадровоеПеремещениеОрганизаций.ФизЛицо КАК ФизЛицо,
		|	КадровоеПеремещениеОрганизаций.ДатаНачала КАК Дата,
		|	ВоинскийУчетСрезПоследних.ОтношениеКВоинскойОбязанности,
		|	КадровоеПеремещениеОрганизаций.Должность КАК Должность,
		|	КадровоеПеремещениеОрганизаций.ПодразделениеОрганизации КАК ПодразделениеОрганизации,
		|	ВоинскийУчетСрезПоследних.ВУС1,
		|	ВоинскийУчетСрезПоследних.Звание,
		|	ВоинскийУчетСрезПоследних.Военкомат,
		|	ВоинскийУчетСрезПоследних.НомерВоенногоБилета,	
		|	ФИОФизЛицСрезПоследних.Фамилия,
		|	ФИОФизЛицСрезПоследних.Имя,
		|	ФИОФизЛицСрезПоследних.Отчество,
		|	КадровоеПеремещениеОрганизаций.ФизЛицо.Наименование КАК ФизЛицоНаименование,
		|	СемейноеПоложениеФизЛицСрезПоследних.СемейноеПоложение
		|ИЗ
		|	Документ.КадровоеПеремещениеОрганизаций.РаботникиОрганизации КАК КадровоеПеремещениеОрганизаций
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВоинскийУчет.СрезПоследних(&КонПериода, ) КАК ВоинскийУчетСрезПоследних
		|		ПО КадровоеПеремещениеОрганизаций.ФизЛицо = ВоинскийУчетСрезПоследних.Физлицо
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
		|		ПО КадровоеПеремещениеОрганизаций.ФизЛицо = КонтактнаяИнформация.Объект
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизЛиц.СрезПоследних(&КонПериода, ) КАК ФИОФизЛицСрезПоследних
		|		ПО КадровоеПеремещениеОрганизаций.ФизЛицо = ФИОФизЛицСрезПоследних.ФизЛицо
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СемейноеПоложениеФизЛиц.СрезПоследних КАК СемейноеПоложениеФизЛицСрезПоследних
		|   	ПО КадровоеПеремещениеОрганизаций.ФизЛицо = СемейноеПоложениеФизЛицСрезПоследних.ФизЛицо
		|ГДЕ
		|	(ВоинскийУчетСрезПоследних.ОтношениеКВоинскойОбязанности = ЗНАЧЕНИЕ(Перечисление.ОтношениеКВоинскойОбязанности.Военнообязанный)
		|    ИЛИ ВоинскийУчетСрезПоследних.ОтношениеКВоинскойОбязанности = ЗНАЧЕНИЕ(Перечисление.ОтношениеКВоинскойОбязанности.Призывник))
		|	И КадровоеПеремещениеОрганизаций.ДатаНачала МЕЖДУ &НачПериода И &КонПериода
		|	//И ВоинскийУчетСрезПоследних.Военкомат = &Военкомат
		|ОБЪЕДИНИТЬ ВСЕ
		|";
	КонецЕсли;
	//Аверсон 25.03.2020 КВВ СВФР-005728 )
	
	ТекстЗапроса = ТекстЗапроса + "
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПриемНаРаботуВОрганизациюРаботникиОрганизации.Ссылка,
	|	ПриемНаРаботуВОрганизациюРаботникиОрганизации.ФизЛицо КАК ФизЛицо,
	|	ПриемНаРаботуВОрганизациюРаботникиОрганизации.ДатаПриема КАК Дата,
	|	ВоинскийУчетСрезПоследних.ОтношениеКВоинскойОбязанности,
	|	ПриемНаРаботуВОрганизациюРаботникиОрганизации.Должность КАК Должность,
	|	ПриемНаРаботуВОрганизациюРаботникиОрганизации.ПодразделениеОрганизации КАК ПодразделениеОрганизации,
	|	ВоинскийУчетСрезПоследних.ВУС1,
	|	ВоинскийУчетСрезПоследних.Звание,
	|	ВоинскийУчетСрезПоследних.Военкомат,
	|	ВоинскийУчетСрезПоследних.НомерВоенногоБилета,	
	|	ФИОФизЛицСрезПоследних.Фамилия,
	|	ФИОФизЛицСрезПоследних.Имя,
	|	ФИОФизЛицСрезПоследних.Отчество,
	|	ПриемНаРаботуВОрганизациюРаботникиОрганизации.ФизЛицо.Наименование КАК ФизЛицоНаименование,
	|	СемейноеПоложениеФизЛицСрезПоследних.СемейноеПоложение
	
	|ИЗ
	|	Документ.ПриемНаРаботуВОрганизацию.РаботникиОрганизации КАК ПриемНаРаботуВОрганизациюРаботникиОрганизации
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВоинскийУчет.СрезПоследних(&КонПериода, ) КАК ВоинскийУчетСрезПоследних
	|		ПО ПриемНаРаботуВОрганизациюРаботникиОрганизации.ФизЛицо = ВоинскийУчетСрезПоследних.Физлицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	|		ПО ПриемНаРаботуВОрганизациюРаботникиОрганизации.ФизЛицо = КонтактнаяИнформация.Объект
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизЛиц.СрезПоследних(&КонПериода, ) КАК ФИОФизЛицСрезПоследних
	|		ПО ПриемНаРаботуВОрганизациюРаботникиОрганизации.ФизЛицо = ФИОФизЛицСрезПоследних.ФизЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СемейноеПоложениеФизЛиц.СрезПоследних КАК СемейноеПоложениеФизЛицСрезПоследних
	|   	ПО ПриемНаРаботуВОрганизациюРаботникиОрганизации.ФизЛицо = СемейноеПоложениеФизЛицСрезПоследних.ФизЛицо

	|ГДЕ
	|	(ВоинскийУчетСрезПоследних.ОтношениеКВоинскойОбязанности = ЗНАЧЕНИЕ(Перечисление.ОтношениеКВоинскойОбязанности.Военнообязанный)
	//заявка №2026 (база заявок Кристалла) Дмитрук О.Г.
	|    ИЛИ ВоинскийУчетСрезПоследних.ОтношениеКВоинскойОбязанности = ЗНАЧЕНИЕ(Перечисление.ОтношениеКВоинскойОбязанности.Призывник))
	//заявка №2026
	|	И ПриемНаРаботуВОрганизациюРаботникиОрганизации.ДатаПриема МЕЖДУ &НачПериода И &КонПериода
	|	//И ВоинскийУчетСрезПоследних.Военкомат = &Военкомат
	
	|ОБЪЕДИНИТЬ ВСЕ
	
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	УвольнениеИзОрганизацийРаботникиОрганизации.Ссылка,
	|	УвольнениеИзОрганизацийРаботникиОрганизации.Физлицо КАК ФизЛицо,
	|	УвольнениеИзОрганизацийРаботникиОрганизации.ДатаУвольнения КАК Дата,
	|	ВоинскийУчетСрезПоследних.ОтношениеКВоинскойОбязанности,
	|	РаботникиОрганизацийСрезПоследних.Должность,
	|	РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации,
	|	ВоинскийУчетСрезПоследних.ВУС1,
	|	ВоинскийУчетСрезПоследних.Звание,
	|	ВоинскийУчетСрезПоследних.Военкомат,
	|	ВоинскийУчетСрезПоследних.НомерВоенногоБилета,	
	|	ФИОФизЛицСрезПоследних.Фамилия,
	|	ФИОФизЛицСрезПоследних.Имя,
	|	ФИОФизЛицСрезПоследних.Отчество,
	|	УвольнениеИзОрганизацийРаботникиОрганизации.Физлицо.Наименование КАК ФизЛицоНаименование,
	|	СемейноеПоложениеФизЛицСрезПоследних.СемейноеПоложение
	
	|ИЗ
	|	Документ.УвольнениеИзОрганизаций.РаботникиОрганизации КАК УвольнениеИзОрганизацийРаботникиОрганизации
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВоинскийУчет.СрезПоследних(&КонПериода, ) КАК ВоинскийУчетСрезПоследних
	|		ПО УвольнениеИзОрганизацийРаботникиОрганизации.Физлицо = ВоинскийУчетСрезПоследних.Физлицо
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций.СрезПоследних(&НачПериода, ) КАК РаботникиОрганизацийСрезПоследних
	|		ПО УвольнениеИзОрганизацийРаботникиОрганизации.Сотрудник = РаботникиОрганизацийСрезПоследних.Сотрудник
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	|		ПО УвольнениеИзОрганизацийРаботникиОрганизации.Физлицо = КонтактнаяИнформация.Объект
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизЛиц.СрезПоследних(&КонПериода, ) КАК ФИОФизЛицСрезПоследних
	|		ПО УвольнениеИзОрганизацийРаботникиОрганизации.ФизЛицо = ФИОФизЛицСрезПоследних.ФизЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СемейноеПоложениеФизЛиц.СрезПоследних КАК СемейноеПоложениеФизЛицСрезПоследних
	|   	ПО УвольнениеИзОрганизацийРаботникиОрганизации.Физлицо = СемейноеПоложениеФизЛицСрезПоследних.ФизЛицо

	|ГДЕ
	|	ВоинскийУчетСрезПоследних.ОтношениеКВоинскойОбязанности = ЗНАЧЕНИЕ(Перечисление.ОтношениеКВоинскойОбязанности.Военнообязанный)
	|	И УвольнениеИзОрганизацийРаботникиОрганизации.ДатаУвольнения МЕЖДУ &НачПериода И &КонПериода
	|	//И ВоинскийУчетСрезПоследних.Военкомат = &Военкомат
	
	|УПОРЯДОЧИТЬ ПО
	|	ФизЛицоНаименование,
	|	Дата"; //Аверсон 25.03.2020 КВВ СВФР-005728
	
	Запрос.УстановитьПараметр("НачПериода",НачПериод);
	Запрос.УстановитьПараметр("КонПериода",КонПериод);
	Запрос.УстановитьПараметр("Организация", Организация);
	
	Если ЗначениеЗаполнено(Военкомат) тогда
		Запрос.УстановитьПараметр("Военкомат", Военкомат);
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"//И ВоинскийУчетСрезПоследних.Военкомат = &Военкомат","И ВоинскийУчетСрезПоследних.Военкомат = &Военкомат");
	КонецЕсли;
	
	Запрос.Текст = ТекстЗапроса;
	
	Результат = Запрос.Выполнить();
	
	ДокументРезультат.Очистить();

	Область = мМакет.ПолучитьОбласть("Заголовок");
	Область.Параметры.Организация = Организация;
	Область.Параметры.Военкомат = ?(ЗначениеЗаполнено(Военкомат),СокрЛП(Военкомат.Наименование),"");
	//Аверсон 25.03.2020 КВВ СВФР-005728 (
	Область.Параметры.ВоенкоматНаим = ?(ЗначениеЗаполнено(Военкомат),СокрЛП(Военкомат.Наименование),"");
	Область.Параметры.ВоенкоматАдрес = ?(ЗначениеЗаполнено(Военкомат),СокрЛП(Военкомат.Индекс) + ?(ЗначениеЗаполнено(Военкомат.Индекс),", ","") + СокрЛП(Военкомат.Адрес),"");
	Область.Параметры.ВоенкоматТел = ?(ЗначениеЗаполнено(Военкомат),СокрЛП(Военкомат.Телефоны),"");
	//Аверсон 25.03.2020 КВВ СВФР-005728 )

	ДокументРезультат.Вывести(Область);
					
	//Параметры документа
	ДокументРезультат.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	ДокументРезультат.ПолеСлева			 = 0;
	ДокументРезультат.ПолеСправа		 = 0;
		
	Область = мМакет.ПолучитьОбласть("Шапка");
	ДокументРезультат.Вывести(Область);
	
	ВыборкаИтог = Результат.Выбрать(ОбходРезультатаЗапроса.Прямой);
	
	мНомер = 0;
	ВывестиСтрокиПодразделения(ВыборкаИтог, ДокументРезультат);
	
	Область = мМакет.ПолучитьОбласть("Подвал");
	
	СпрОрганизации = Организация.ПолучитьОбъект();
	//ТЗ = СпрОрганизации.ОтветственныеЛица.Выгрузить();
	//ТЗ.Сортировать("Дата Убыв"); 
	//ИнженерНашли = 0; 
	//Для Каждого НоваяСтр из ТЗ Цикл
	//	Если НачПериод >= НоваяСтр.Дата Тогда
	//		Если НоваяСтр.ОтветственноеЛицо = Перечисления.ОтветственныеЛицаОрганизаций.ИнженерПоСпецРаботеИГО и ИнженерНашли = 0 Тогда
	//			ИнженерФИО = ПроцедурыУправленияПерсоналом.ИнициалыФамилияФизЛица(НоваяСтр.Сотрудник.Наименование);
	//			ИнженерДолжность = НоваяСтр.Должность;
	//			ИнженерНашли = 1;
	//		КонецЕсли;
	//	КонецЕсли;
	//КонецЦикла;
	//Область.Параметры.ДолжностьОтв = ИнженерДолжность;
	//Область.Параметры.ФамилияОтв = ИнженерФИО;

	//Аверсон 25.03.2020 КВВ СВФР-005728 (
	Область.Параметры.ДолжностьОтв = СокрЛП(мВоенноОбязПодписиДолж);
	Область.Параметры.ФамилияОтв = СокрЛП(мВоенноОбязПодписиСотр);
	//Аверсон 25.03.2020 КВВ СВФР-005728 )
	
	ДокументРезультат.Вывести(Область);
	КонецЕсли;
	//+++Аверсон 27.11.2020 ПСА СВФР-006882

КонецПроцедуры

//Аверсон 27.11.2020 ПСА СВФР-006882 +++
Процедура СформироватьОтчетПриложение5(ДокументРезультат, Дописать = Ложь, мВоенноОбязПодписиДолж,мВоенноОбязПодписиСотр) 	
	мМакет = ПолучитьМакет("Приложение5");
	
	Запрос = Новый Запрос;
	ТекстЗапроса = "";
	Если ВклИзмРегСвСемПолож Тогда
		ТекстЗапроса = 	"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ЗНАЧЕНИЕ(Документ.ИзменениеПериодическихРеквизитов.ПустаяСсылка) КАК Ссылка,
		|	СПФЛ.ФизЛицо КАК ФизЛицо,
		|	СПФЛ.Период КАК Дата,
		|	ВоинскийУчетСрезПоследних.ОтношениеКВоинскойОбязанности,
		|	ЗНАЧЕНИЕ(Справочник.ДолжностиОрганизаций.ПустаяСсылка) КАК Должность,
		|	ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка) КАК ПодразделениеОрганизации,
		|	ВоинскийУчетСрезПоследних.ВУС1,
		|	ВоинскийУчетСрезПоследних.Звание,
		|	ВоинскийУчетСрезПоследних.Военкомат,
		|	ВоинскийУчетСрезПоследних.НомерВоенногоБилета,	
		|	ФИОФизЛицСрезПоследних.Фамилия,
		|	ФИОФизЛицСрезПоследних.Имя,
		|	ФИОФизЛицСрезПоследних.Отчество,
		|	СПФЛ.ФизЛицо.Наименование КАК ФизЛицоНаименование,
		|	СемейноеПоложениеФизЛицСрезПоследних.СемейноеПоложение,
		
		//Аверсон ЕАЕ 04.02.2022 СВФР-008704
		|	СПФЛ.ФизЛицо.СтраховойНомерПФР КАК ИдентификационныйНомер
		//Аверсон СВФР-008704
		
		|ИЗ
		|	РегистрСведений.СемейноеПоложениеФизЛиц КАК СПФЛ
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВоинскийУчет.СрезПоследних(&КонПериода, ) КАК ВоинскийУчетСрезПоследних
		|		ПО СПФЛ.ФизЛицо = ВоинскийУчетСрезПоследних.Физлицо
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
		|		ПО СПФЛ.ФизЛицо = КонтактнаяИнформация.Объект
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизЛиц.СрезПоследних(&КонПериода, ) КАК ФИОФизЛицСрезПоследних
		|		ПО СПФЛ.ФизЛицо = ФИОФизЛицСрезПоследних.ФизЛицо
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СемейноеПоложениеФизЛиц.СрезПоследних КАК СемейноеПоложениеФизЛицСрезПоследних
		|   	ПО СПФЛ.ФизЛицо = СемейноеПоложениеФизЛицСрезПоследних.ФизЛицо
		|ГДЕ
		|	(ВоинскийУчетСрезПоследних.ОтношениеКВоинскойОбязанности = ЗНАЧЕНИЕ(Перечисление.ОтношениеКВоинскойОбязанности.Военнообязанный)
		|    ИЛИ ВоинскийУчетСрезПоследних.ОтношениеКВоинскойОбязанности = ЗНАЧЕНИЕ(Перечисление.ОтношениеКВоинскойОбязанности.Призывник))
		|	И СПФЛ.Период МЕЖДУ &НачПериода И &КонПериода
		|	//И ВоинскийУчетСрезПоследних.Военкомат = &Военкомат
		|ОБЪЕДИНИТЬ ВСЕ
		|";
	КонецЕсли;
	
	Если ВклКадрПеремещения Тогда 
		ТекстЗапроса = ТекстЗапроса + "
		|	ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	КадровоеПеремещениеОрганизаций.Ссылка,
		|	КадровоеПеремещениеОрганизаций.ФизЛицо КАК ФизЛицо,
		|	КадровоеПеремещениеОрганизаций.ДатаНачала КАК Дата,
		|	ВоинскийУчетСрезПоследних.ОтношениеКВоинскойОбязанности,
		|	КадровоеПеремещениеОрганизаций.Должность КАК Должность,
		|	КадровоеПеремещениеОрганизаций.ПодразделениеОрганизации КАК ПодразделениеОрганизации,
		|	ВоинскийУчетСрезПоследних.ВУС1,
		|	ВоинскийУчетСрезПоследних.Звание,
		|	ВоинскийУчетСрезПоследних.Военкомат,
		|	ВоинскийУчетСрезПоследних.НомерВоенногоБилета,	
		|	ФИОФизЛицСрезПоследних.Фамилия,
		|	ФИОФизЛицСрезПоследних.Имя,
		|	ФИОФизЛицСрезПоследних.Отчество,
		|	КадровоеПеремещениеОрганизаций.ФизЛицо.Наименование КАК ФизЛицоНаименование,
		|	СемейноеПоложениеФизЛицСрезПоследних.СемейноеПоложение,
		
		//Аверсон ЕАЕ 04.02.2022 СВФР-008704
		|	КадровоеПеремещениеОрганизаций.ФизЛицо.СтраховойНомерПФР КАК ИдентификационныйНомер
		//Аверсон СВФР-008704
		
		|ИЗ
		|	Документ.КадровоеПеремещениеОрганизаций.РаботникиОрганизации КАК КадровоеПеремещениеОрганизаций
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВоинскийУчет.СрезПоследних(&КонПериода, ) КАК ВоинскийУчетСрезПоследних
		|		ПО КадровоеПеремещениеОрганизаций.ФизЛицо = ВоинскийУчетСрезПоследних.Физлицо
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
		|		ПО КадровоеПеремещениеОрганизаций.ФизЛицо = КонтактнаяИнформация.Объект
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизЛиц.СрезПоследних(&КонПериода, ) КАК ФИОФизЛицСрезПоследних
		|		ПО КадровоеПеремещениеОрганизаций.ФизЛицо = ФИОФизЛицСрезПоследних.ФизЛицо
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СемейноеПоложениеФизЛиц.СрезПоследних КАК СемейноеПоложениеФизЛицСрезПоследних
		|   	ПО КадровоеПеремещениеОрганизаций.ФизЛицо = СемейноеПоложениеФизЛицСрезПоследних.ФизЛицо
		|ГДЕ
		|	(ВоинскийУчетСрезПоследних.ОтношениеКВоинскойОбязанности = ЗНАЧЕНИЕ(Перечисление.ОтношениеКВоинскойОбязанности.Военнообязанный)
		|    ИЛИ ВоинскийУчетСрезПоследних.ОтношениеКВоинскойОбязанности = ЗНАЧЕНИЕ(Перечисление.ОтношениеКВоинскойОбязанности.Призывник))
		|	И КадровоеПеремещениеОрганизаций.ДатаНачала МЕЖДУ &НачПериода И &КонПериода
		|	//И ВоинскийУчетСрезПоследних.Военкомат = &Военкомат
		|ОБЪЕДИНИТЬ ВСЕ
		|";
	КонецЕсли;
	
	ТекстЗапроса = ТекстЗапроса + "
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПриемНаРаботуВОрганизациюРаботникиОрганизации.Ссылка,
	|	ПриемНаРаботуВОрганизациюРаботникиОрганизации.ФизЛицо КАК ФизЛицо,
	|	ПриемНаРаботуВОрганизациюРаботникиОрганизации.ДатаПриема КАК Дата,
	|	ВоинскийУчетСрезПоследних.ОтношениеКВоинскойОбязанности,
	|	ПриемНаРаботуВОрганизациюРаботникиОрганизации.Должность КАК Должность,
	|	ПриемНаРаботуВОрганизациюРаботникиОрганизации.ПодразделениеОрганизации КАК ПодразделениеОрганизации,
	|	ВоинскийУчетСрезПоследних.ВУС1,
	|	ВоинскийУчетСрезПоследних.Звание,
	|	ВоинскийУчетСрезПоследних.Военкомат,
	|	ВоинскийУчетСрезПоследних.НомерВоенногоБилета,	
	|	ФИОФизЛицСрезПоследних.Фамилия,
	|	ФИОФизЛицСрезПоследних.Имя,
	|	ФИОФизЛицСрезПоследних.Отчество,
	|	ПриемНаРаботуВОрганизациюРаботникиОрганизации.ФизЛицо.Наименование КАК ФизЛицоНаименование,
	|	СемейноеПоложениеФизЛицСрезПоследних.СемейноеПоложение,
		
	//Аверсон ЕАЕ 04.02.2022 СВФР-008704
	|	ПриемНаРаботуВОрганизациюРаботникиОрганизации.ФизЛицо.СтраховойНомерПФР КАК ИдентификационныйНомер
	//Аверсон СВФР-008704
		
	|ИЗ
	|	Документ.ПриемНаРаботуВОрганизацию.РаботникиОрганизации КАК ПриемНаРаботуВОрганизациюРаботникиОрганизации
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВоинскийУчет.СрезПоследних(&КонПериода, ) КАК ВоинскийУчетСрезПоследних
	|		ПО ПриемНаРаботуВОрганизациюРаботникиОрганизации.ФизЛицо = ВоинскийУчетСрезПоследних.Физлицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	|		ПО ПриемНаРаботуВОрганизациюРаботникиОрганизации.ФизЛицо = КонтактнаяИнформация.Объект
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизЛиц.СрезПоследних(&КонПериода, ) КАК ФИОФизЛицСрезПоследних
	|		ПО ПриемНаРаботуВОрганизациюРаботникиОрганизации.ФизЛицо = ФИОФизЛицСрезПоследних.ФизЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СемейноеПоложениеФизЛиц.СрезПоследних КАК СемейноеПоложениеФизЛицСрезПоследних
	|   	ПО ПриемНаРаботуВОрганизациюРаботникиОрганизации.ФизЛицо = СемейноеПоложениеФизЛицСрезПоследних.ФизЛицо

	|ГДЕ
	|	(ВоинскийУчетСрезПоследних.ОтношениеКВоинскойОбязанности = ЗНАЧЕНИЕ(Перечисление.ОтношениеКВоинскойОбязанности.Военнообязанный)
	//заявка №2026 (база заявок Кристалла) Дмитрук О.Г.
	|    ИЛИ ВоинскийУчетСрезПоследних.ОтношениеКВоинскойОбязанности = ЗНАЧЕНИЕ(Перечисление.ОтношениеКВоинскойОбязанности.Призывник))
	//заявка №2026
	|	И ПриемНаРаботуВОрганизациюРаботникиОрганизации.ДатаПриема МЕЖДУ &НачПериода И &КонПериода
	|	//И ВоинскийУчетСрезПоследних.Военкомат = &Военкомат
	
	|ОБЪЕДИНИТЬ ВСЕ
	
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	УвольнениеИзОрганизацийРаботникиОрганизации.Ссылка,
	|	УвольнениеИзОрганизацийРаботникиОрганизации.Физлицо КАК ФизЛицо,
	|	УвольнениеИзОрганизацийРаботникиОрганизации.ДатаУвольнения КАК Дата,
	|	ВоинскийУчетСрезПоследних.ОтношениеКВоинскойОбязанности,
	|	РаботникиОрганизацийСрезПоследних.Должность,
	|	РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации,
	|	ВоинскийУчетСрезПоследних.ВУС1,
	|	ВоинскийУчетСрезПоследних.Звание,
	|	ВоинскийУчетСрезПоследних.Военкомат,
	|	ВоинскийУчетСрезПоследних.НомерВоенногоБилета,	
	|	ФИОФизЛицСрезПоследних.Фамилия,
	|	ФИОФизЛицСрезПоследних.Имя,
	|	ФИОФизЛицСрезПоследних.Отчество,
	|	УвольнениеИзОрганизацийРаботникиОрганизации.Физлицо.Наименование КАК ФизЛицоНаименование,
	|	СемейноеПоложениеФизЛицСрезПоследних.СемейноеПоложение,
		
	//Аверсон ЕАЕ 04.02.2022 СВФР-008704
	|	УвольнениеИзОрганизацийРаботникиОрганизации.ФизЛицо.СтраховойНомерПФР КАК ИдентификационныйНомер
	//Аверсон СВФР-008704
		
	|ИЗ
	|	Документ.УвольнениеИзОрганизаций.РаботникиОрганизации КАК УвольнениеИзОрганизацийРаботникиОрганизации
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВоинскийУчет.СрезПоследних(&КонПериода, ) КАК ВоинскийУчетСрезПоследних
	|		ПО УвольнениеИзОрганизацийРаботникиОрганизации.Физлицо = ВоинскийУчетСрезПоследних.Физлицо
	
	//СВЭЙ 12.11.2023 КВВ СВФР-011792 (пункт 3) (
	//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций.СрезПоследних(&НачПериода, ) КАК РаботникиОрганизацийСрезПоследних
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций.СрезПоследних(&КонПериода, ) КАК РаботникиОрганизацийСрезПоследних
	//СВЭЙ 12.11.2023 КВВ СВФР-011792 (пункт 3) )
	
	|		ПО УвольнениеИзОрганизацийРаботникиОрганизации.Сотрудник = РаботникиОрганизацийСрезПоследних.Сотрудник
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	|		ПО УвольнениеИзОрганизацийРаботникиОрганизации.Физлицо = КонтактнаяИнформация.Объект
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизЛиц.СрезПоследних(&КонПериода, ) КАК ФИОФизЛицСрезПоследних
	|		ПО УвольнениеИзОрганизацийРаботникиОрганизации.ФизЛицо = ФИОФизЛицСрезПоследних.ФизЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СемейноеПоложениеФизЛиц.СрезПоследних КАК СемейноеПоложениеФизЛицСрезПоследних
	|   	ПО УвольнениеИзОрганизацийРаботникиОрганизации.Физлицо = СемейноеПоложениеФизЛицСрезПоследних.ФизЛицо

	|ГДЕ
	|	ВоинскийУчетСрезПоследних.ОтношениеКВоинскойОбязанности = ЗНАЧЕНИЕ(Перечисление.ОтношениеКВоинскойОбязанности.Военнообязанный)
	|	И УвольнениеИзОрганизацийРаботникиОрганизации.ДатаУвольнения МЕЖДУ &НачПериода И &КонПериода
	|	//И ВоинскийУчетСрезПоследних.Военкомат = &Военкомат
	
	|УПОРЯДОЧИТЬ ПО
	|	ФизЛицоНаименование,
	|	Дата"; //Аверсон 25.03.2020 КВВ СВФР-005728
	
	//Аверсон ЕАЕ 16.09.2025 СВФР-016471
	//Перепишем запрос, т.к. данные воинского учета нам надо получать на дату кадрового изменения, а не на конец периода
	///////////////////////////////////////////////////////////////////////////////////////////
	ТекстЗапроса = "";
	
	//Прием
	ТекстЗапроса = ТекстЗапроса + "
	|ВЫБРАТЬ
	|	""Прием"" КАК Вид,
	|	ПриемНаРаботуВОрганизацию.Ссылка КАК Ссылка,
	|	ПриемНаРаботуВОрганизацию.ФизЛицо КАК ФизЛицо,
	|   ПриемНаРаботуВОрганизацию.ДатаПриема КАК Дата,
	|	ПриемНаРаботуВОрганизацию.Должность КАК Должность,
	|	ПриемНаРаботуВОрганизацию.ПодразделениеОрганизации КАК ПодразделениеОрганизации
	|ПОМЕСТИТЬ ВТИзменения
	|ИЗ Документ.ПриемНаРаботуВОрганизацию.РаботникиОрганизации КАК ПриемНаРаботуВОрганизацию
	|ГДЕ ПриемНаРаботуВОрганизацию.ДатаПриема МЕЖДУ &НачПериода И &КонПериода
	|И ПриемНаРаботуВОрганизацию.Ссылка.Проведен
	|";
	
	//Увольнение
	ТекстЗапроса = ТекстЗапроса + "
	|ОБЪЕДИНИТЬ ВСЕ
	|ВЫБРАТЬ
	|	""Увольнение"" КАК Вид,
	|	УвольнениеИзОрганизаций.Ссылка КАК Ссылка,
	|	УвольнениеИзОрганизаций.ФизЛицо КАК ФизЛицо,
	|   УвольнениеИзОрганизаций.ДатаУвольнения КАК Дата,
	|	РаботникиОрганизацийСрезПоследних.Должность,
	|	РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации
	|ИЗ Документ.УвольнениеИзОрганизаций.РаботникиОрганизации КАК УвольнениеИзОрганизаций
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций.СрезПоследних(&КонПериода, ) КАК РаботникиОрганизацийСрезПоследних
	|       ПО УвольнениеИзОрганизаций.Сотрудник = РаботникиОрганизацийСрезПоследних.Сотрудник
	|ГДЕ УвольнениеИзОрганизаций.ДатаУвольнения МЕЖДУ &НачПериода И &КонПериода
	|И УвольнениеИзОрганизаций.Ссылка.Проведен
	|";
	
	//Изменение семейного положения
	Если ВклИзмРегСвСемПолож Тогда
		ТекстЗапроса = ТекстЗапроса + "
		|ОБЪЕДИНИТЬ ВСЕ
		|ВЫБРАТЬ
		|	""Изменение семейного положения"" КАК Вид,
		|	ЗНАЧЕНИЕ(Документ.ИзменениеПериодическихРеквизитов.ПустаяСсылка) КАК Ссылка,
		|	СПФЛ.ФизЛицо КАК ФизЛицо,
		|   СПФЛ.Период КАК Дата,
		|	ЗНАЧЕНИЕ(Справочник.ДолжностиОрганизаций.ПустаяСсылка) КАК Должность,
		|	ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка) КАК ПодразделениеОрганизации
		|ИЗ РегистрСведений.СемейноеПоложениеФизЛиц КАК СПФЛ
		|ГДЕ СПФЛ.Период МЕЖДУ &НачПериода И &КонПериода
		|";
	КонецЕсли;
	
	//Изменения в образовании
	Если УчитыватьИзмененияПоОбразованию Тогда 
		ТекстЗапроса = ТекстЗапроса + "
		|ОБЪЕДИНИТЬ ВСЕ
		|ВЫБРАТЬ
		|	""Изменение образования"" КАК Вид,
		|	ЗНАЧЕНИЕ(Документ.ИзменениеПериодическихРеквизитов.ПустаяСсылка) КАК Ссылка,
		|	ОбрФЛ.Ссылка КАК ФизЛицо,
		|   ОбрФЛ.ЗаписьДействуетС КАК Дата,
		|	ЗНАЧЕНИЕ(Справочник.ДолжностиОрганизаций.ПустаяСсылка) КАК Должность,
		|	ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка) КАК ПодразделениеОрганизации
		|ИЗ Справочник.ФизическиеЛица.Образование КАК ОбрФЛ
		|ГДЕ ОбрФЛ.ЗаписьДействуетС МЕЖДУ &НачПериода И &КонПериода
		|И ОбрФЛ.ОсновноеОбразование
		|";
	КонецЕсли;
	
	//Кадровые перемещения
	Если ВклКадрПеремещения Тогда
		ТекстЗапроса = ТекстЗапроса + "
		|ОБЪЕДИНИТЬ ВСЕ
		|ВЫБРАТЬ
		|	""Кадровое перемещние"" КАК Вид,
		|	КадровоеПеремещениеОрганизаций.Ссылка КАК Ссылка,
		|	КадровоеПеремещениеОрганизаций.ФизЛицо КАК ФизЛицо,
		|   КадровоеПеремещениеОрганизаций.ДатаНачала КАК Дата,
		|	КадровоеПеремещениеОрганизаций.Должность КАК Должность,
		|	КадровоеПеремещениеОрганизаций.ПодразделениеОрганизации КАК ПодразделениеОрганизации
		|ИЗ Документ.КадровоеПеремещениеОрганизаций.РаботникиОрганизации КАК КадровоеПеремещениеОрганизаций
		|ГДЕ КадровоеПеремещениеОрганизаций.ДатаНачала МЕЖДУ &НачПериода И &КонПериода
		|И КадровоеПеремещениеОрганизаций.Ссылка.Проведен
		|";
	КонецЕсли;
	
	//Получим данные воинского учета
	ТекстЗапроса = ТекстЗапроса + "
	|;
	|////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТИзменения.Ссылка,
	|	ВТИзменения.Вид,
	|	ВТИзменения.ФизЛицо,
	|	ВТИзменения.Дата,
	|   ВТИзменения.Должность,
	|   ВТИзменения.ПодразделениеОрганизации,
	|	МАКСИМУМ(ВоинскийУчет.Период) КАК МаксПериод
	|ПОМЕСТИТЬ ВТВоинскийУчетМаксПериоды
	|ИЗ ВТИзменения
	|ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВоинскийУчет КАК ВоинскийУчет
	|ПО ВТИзменения.ФизЛицо = ВоинскийУчет.ФизЛицо
	|	И ВТИзменения.Дата >= ВоинскийУчет.Период
	|СГРУППИРОВАТЬ ПО
	|	ВТИзменения.Ссылка,
	|	ВТИзменения.Вид,
	|	ВТИзменения.ФизЛицо,
	|	ВТИзменения.Дата,
	|   ВТИзменения.Должность,
	|   ВТИзменения.ПодразделениеОрганизации
	|;
	|///////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТВоинскийУчетМаксПериоды.Ссылка,
	|	ВТВоинскийУчетМаксПериоды.Вид,
	|	ВТВоинскийУчетМаксПериоды.ФизЛицо,
	|	ВТВоинскийУчетМаксПериоды.Дата,
	|   ВТВоинскийУчетМаксПериоды.Должность,
	|   ВТВоинскийУчетМаксПериоды.ПодразделениеОрганизации,
	|   ВоинскийУчет.ОтношениеКВоинскойОбязанности,
	|   ВоинскийУчет.ОтношениеКВоинскомуУчету,
	|	ВоинскийУчет.ВУС1,
	|	ВоинскийУчет.Звание,
	|	ВоинскийУчет.Военкомат,
	|	ВоинскийУчет.НомерВоенногоБилета,
	|   ВТВоинскийУчетМаксПериоды.ФизЛицо.Наименование КАК ФизЛицоНаименование,
	|   ВТВоинскийУчетМаксПериоды.ФизЛицо.СтраховойНомерПФР КАК ИдентификационныйНомер,
	|	ФИОФизЛицСрезПоследних.Фамилия,
	|	ФИОФизЛицСрезПоследних.Имя,
	|	ФИОФизЛицСрезПоследних.Отчество,
	|	СемейноеПоложениеФизЛицСрезПоследних.СемейноеПоложение
	
	|ИЗ ВТВоинскийУчетМаксПериоды
	|ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВоинскийУчет КАК ВоинскийУчет
	|ПО ВТВоинскийУчетМаксПериоды.ФизЛицо = ВоинскийУчет.ФизЛицо
	|	И ВТВоинскийУчетМаксПериоды.МаксПериод = ВоинскийУчет.Период
	//|ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	//|ПО ВТВоинскийУчетМаксПериоды.Физлицо = КонтактнаяИнформация.Объект
	|ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизЛиц.СрезПоследних(&КонПериода, ) КАК ФИОФизЛицСрезПоследних
	|ПО ВТВоинскийУчетМаксПериоды.ФизЛицо = ФИОФизЛицСрезПоследних.ФизЛицо
	|ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СемейноеПоложениеФизЛиц.СрезПоследних КАК СемейноеПоложениеФизЛицСрезПоследних
	|ПО ВТВоинскийУчетМаксПериоды.Физлицо = СемейноеПоложениеФизЛицСрезПоследних.ФизЛицо
	
	|ГДЕ
	|	(ВоинскийУчет.ОтношениеКВоинскойОбязанности = ЗНАЧЕНИЕ(Перечисление.ОтношениеКВоинскойОбязанности.Военнообязанный)
	|    ИЛИ ВоинскийУчет.ОтношениеКВоинскойОбязанности = ЗНАЧЕНИЕ(Перечисление.ОтношениеКВоинскойОбязанности.Призывник))
	|	//И ВоинскийУчет.Военкомат = &Военкомат
	
	|ОБЪЕДИНИТЬ ВСЕ
	
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Документ.ИзменениеПериодическихРеквизитов.ПустаяСсылка) КАК Ссылка,
	|   ""Снятие с учета"" КАК Вид,
	|	ВоинскийУчет.ФизЛицо,
	|	ВоинскийУчет.Период,
	|	ЗНАЧЕНИЕ(Справочник.ДолжностиОрганизаций.ПустаяСсылка) КАК Должность,
	|	ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка) КАК ПодразделениеОрганизации,
	|	ВоинскийУчет.ОтношениеКВоинскойОбязанности,
	|   ВоинскийУчет.ОтношениеКВоинскомуУчету,
	|	ВоинскийУчет.ВУС1,
	|	ВоинскийУчет.Звание,
	|	ВоинскийУчет.Военкомат,
	|	ВоинскийУчет.НомерВоенногоБилета,
	|   ВоинскийУчет.ФизЛицо.Наименование,
	|   ВоинскийУчет.ФизЛицо.СтраховойНомерПФР,
	|	ФИОФизЛицСрезПоследних.Фамилия,
	|	ФИОФизЛицСрезПоследних.Имя,
	|	ФИОФизЛицСрезПоследних.Отчество,
	|   NULL
	
	|ИЗ РегистрСведений.ВоинскийУчет КАК ВоинскийУчет
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизЛиц.СрезПоследних(&КонПериода, ) КАК ФИОФизЛицСрезПоследних
	|	ПО ВоинскийУчет.ФизЛицо = ФИОФизЛицСрезПоследних.ФизЛицо
	|ГДЕ ВоинскийУчет.ОтношениеКВоинскомуУчету = ЗНАЧЕНИЕ(Перечисление.ОтношениеКВоинскомуУчету.СнятПоВозрасту)
	|	И ВоинскийУчет.Период МЕЖДУ &НачПериода И &КонПериода
	|	//И ВоинскийУчет.Военкомат = &Военкомат
	
	|";
	//Аверсон СВФР-016471
	///////////////////////////////////////////////////////////////////////////////////////////
	
	Запрос.УстановитьПараметр("НачПериода",НачПериод);
	Запрос.УстановитьПараметр("КонПериода",КонПериод);
	Запрос.УстановитьПараметр("Организация", Организация);
	
	Если ЗначениеЗаполнено(Военкомат) тогда
		Запрос.УстановитьПараметр("Военкомат", Военкомат);
		
		//Аверсон ЕАЕ 16.09.2025 СВФР-016658
		//ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"//И ВоинскийУчетСрезПоследних.Военкомат = &Военкомат","И ВоинскийУчетСрезПоследних.Военкомат = &Военкомат");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"//И ВоинскийУчет.Военкомат = &Военкомат","И ВоинскийУчет.Военкомат = &Военкомат");
		//Аверсон СВФР-016658
		
	КонецЕсли;
	
	Запрос.Текст = ТекстЗапроса;
	
	Результат = Запрос.Выполнить();
	
	ДокументРезультат.Очистить();

	Область = мМакет.ПолучитьОбласть("Заголовок");
	Область.Параметры.Организация = Организация;
	//Область.Параметры.Военкомат = ?(ЗначениеЗаполнено(Военкомат),СокрЛП(Военкомат.Наименование),"");
	Область.Параметры.ВоенкоматНаим = ?(ЗначениеЗаполнено(Военкомат),СокрЛП(Военкомат.Наименование),"");
	//Область.Параметры.ВоенкоматАдрес = ?(ЗначениеЗаполнено(Военкомат),СокрЛП(Военкомат.Индекс) + ?(ЗначениеЗаполнено(Военкомат.Индекс),", ","") + СокрЛП(Военкомат.Адрес),"");
	//Область.Параметры.ВоенкоматТел = ?(ЗначениеЗаполнено(Военкомат),СокрЛП(Военкомат.Телефоны),"");

	ДокументРезультат.Вывести(Область);
					
	//Параметры документа
	ДокументРезультат.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	ДокументРезультат.ПолеСлева			 = 0;
	ДокументРезультат.ПолеСправа		 = 0;
		
	Область = мМакет.ПолучитьОбласть("Шапка");
	ДокументРезультат.Вывести(Область);
	
	ВыборкаИтог = Результат.Выбрать(ОбходРезультатаЗапроса.Прямой);
	
	мНомер = 0;
	ВывестиСтрокиПодразделенияПриложение5(ВыборкаИтог, ДокументРезультат);
	
	Область = мМакет.ПолучитьОбласть("Подвал");
	
	//СпрОрганизации = Организация.ПолучитьОбъект();
	//ТЗ = СпрОрганизации.ОтветственныеЛица.Выгрузить();
	//ТЗ.Сортировать("Дата Убыв"); 
	//ИнженерНашли = 0; 
	//Для Каждого НоваяСтр из ТЗ Цикл
	//	Если НачПериод >= НоваяСтр.Дата Тогда
	//		Если НоваяСтр.ОтветственноеЛицо = Перечисления.ОтветственныеЛицаОрганизаций.ИнженерПоСпецРаботеИГО и ИнженерНашли = 0 Тогда
	//			ИнженерФИО = ПроцедурыУправленияПерсоналом.ИнициалыФамилияФизЛица(НоваяСтр.Сотрудник.Наименование);
	//			ИнженерДолжность = НоваяСтр.Должность;
	//			ИнженерНашли = 1;
	//		КонецЕсли;
	//	КонецЕсли;
	//КонецЦикла;
	//Область.Параметры.ДолжностьОтв = ИнженерДолжность;
	//Область.Параметры.ФамилияОтв = ИнженерФИО;

	//Аверсон 25.03.2020 КВВ СВФР-005728 (
	//Область.Параметры.ДолжностьОтв = СокрЛП(мВоенноОбязПодписиДолж);
	Область.Параметры.ФамилияОтв = СокрЛП(мВоенноОбязПодписиСотр);
	//Аверсон 25.03.2020 КВВ СВФР-005728 )
	
	ДокументРезультат.Вывести(Область);
	
КонецПроцедуры
//+++Аверсон 27.11.2020 ПСА СВФР-006882

#КонецЕсли
